(define (improve guess x)
        (average guess (/ x guess)))
(define (average x y)
        (/ (+ x y) 2))
(define (sqrt x)
        (sqrt-iter 1.0 x))
(define (square x)
        (* x x))
(define (power x n)
    (if (= n 1)
        x
        (* x (power x (- n 1)))))

;; 修正前
;;(define (good-enough? guess x)
;;        (< (abs (- (square guess) x)) 0.001))
;;
;;(define (sqrt-iter guess x)
;;        (if (good-enough? guess x)
;;            guess
;;            (sqrt-iter (improve guess x) x)))

;; 修正後
(define (good-enough? guess next_guess)
        (< (abs (- guess next_guess)) 0.001))
(define (sqrt-iter guess x)
        (let1 next_guess (improve guess x)
              (if (good-enough? guess next_guess)
                  next_guess
                  (sqrt-iter next_guess x))))

;; 修正前
;;(print (sqrt 9))    ;; 3.00009155413138
;;(print (sqrt (power 10 15))) ;; 無限ループ
;;(print (sqrt 2.0)) ;; 1.4142156862745097
;;(print (sqrt 2.0e-4)) ;; 0.03335281609280434

;; 修正後
(print (sqrt 9))    ;; 3.000000001396984
(print (sqrt (power 10 15))) ;; 31622776.601683907
(print (sqrt 2.0e-4)) ;; 0.014142150140500532

#;;----------
#;;
#;;good-enough?は0.001よりも小さな値の平方根を求める際には機能しない。
#;;なぜなら、guessの値の2乗が0.001よりも小さな値になった時点で**十分小さい**と判断してしまうため。
#;;
#;;```
#;;gosh> (sqrt 0.0001)
#;;1.0
#;;0.50005
#;;0.2501249900009999
#;;0.12526239505846617
#;;0.06303035962394365
#;;0.03230844833048122
#;;0.03230844833048122
#;;gosh> (power 0.0323 2)
#;;0.00104329
#;;gosh> (sqrt 0.00001)
#;;1.0
#;;0.500005
#;;0.250012499900001
#;;0.1250262489500585
#;;0.06255311607712873
#;;0.03135649010771716
#;;0.03135649010771716
#;;```
#;;
#;;
#;; 浮動小数で表現できるのが10進数なら10の15乗くらい。
#;; それ以上だと、表しきれない仮数部が出てきてしまう。
#;;```
#;;(sqrt (power 10 15))
#;;1.0
#;;5.000000000000005e14
#;;2.5000000000000125e14
#;;1.2500000000000262e14
#;;6.250000000000531e13
#;;3.1250000000010656e13
#;;1.5625000000021328e13
#;;7.812500000042664e12
#;;3.906250000085332e12
#;;1.953125000170666e12
#;;9.76562500341333e11
#;;4.882812506826665e11
#;;2.4414062636533325e11
#;;1.2207031523066661e11
#;;6.103516171133321e10
#;;3.0517589047665874e10
#;;1.5258810907827074e10
#;;7.629438221866625e9
#;;3.814784646558015e9
#;;1.9075233922766902e9
#;;954023816.1217878
#;;477536003.99178225
#;;239815043.46673402
#;;121992461.83041875
#;;65094844.81723103
#;;40228522.216194235
#;;32543253.585447475
#;;31635794.320938785
#;;31622779.27999515
#;;31622776.601683907
#;;31622776.601683795
#;;31622776.601683795
#;;...
#;;31622776.601683795
#;;316227*** UNHANDLED-SIGNAL-ERROR: unhandled signal 2 (SIGINT)
#;;```
#;;
#;;
